app/views/home/index.html.erb

SELECT "items".* FROM "items"
---
          <% count = 0 %>
          <% Item.all.each do |item| %>