app/views/carts/index.html.erb

<% @cart.each do |cart| %>
 <%= Item.find(Cart.find(cart.id).item_id).title %>
 <br>
 <%= Item.find(Cart.find(cart.id).item_id).price %>
 <% total += Item.find(Cart.find(cart.id).item_id).price %>
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]