app/controllers/carts_controller.rb

	def index
		puts "prout"
		puts
		if current_user
		@cart = Cart.all.where(user_id: current_user.id)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 1]]

	def create
		puts "AFFICHE PARAMS"
		print params
		Cart.create!(user_id: current_user.id, item_id: params[:item_id])
---
INSERT INTO "carts" ("user_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["item_id", 1], ["created_at", "2018-11-30 02:52:38.192980"], ["updated_at", "2018-11-30 02:52:38.192980"]]