app/controllers/orders_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 1]]
INSERT INTO "orders" ("user_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["item_id", 1], ["created_at", "2018-11-30 03:58:14.768958"], ["updated_at", "2018-11-30 03:58:14.768958"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
  #STRIPE

  # Amount in cents
  @amount = 500
  customer = Stripe::Customer.create(
    :email => params[:stripeEmail],
    :source  => params[:stripeToken]
  )

  charge = Stripe::Charge.create(
    :customer    => customer.id,
    :amount      => @amount,
    :description => 'Rails Stripe customer',
    :currency    => 'usd'
  )

  #CREATION ORDER
  @cart = Cart.all.where(user_id: current_user.id)
  for cart in @cart
    Order.create!(user_id: current_user.id, item_id: cart.item_id)
    Cart.find(cart.id).destroy